$(document).ready(function () {
    //台中市屯區藝文中心
    // $.ajax({
    //     type: "GET",
    //     url: json/Art.json,                                          //"https://www.ttdac.taichung.gov.tw/DataAction",
    //     dataType: "text",
    //     success: function (data) {
            
    //         var obj = JSON.parse(data);
            

    //     }
    // });




/////////////輪播//////////////////
    var iImage = -1;
    setImage();

    function setImage() {
        var img = new Array();

        img[0] = "img/carousel/0.jpg";
        img[1] = "img/carousel/1.jpg";
        img[2] = "img/carousel/2.jpg";
        img[3] = "img/carousel/3.jpg";

        iImage += 1;
        if (iImage >= img.length) {
            iImage = 0;
        }

        document.getElementById("IMGS").src = img[iImage];
        setTimeout(setImage, 3000);
    }










    // art.json的資料
    var jsonList = [{
            "myClass": "巿集",
            "title": "2019藝術市集",
            "myDate": "2019-05-27 10:00 ~ 2019-12-08 17:00",
            "location": "茄苳樹區",
            "MyJoin": "免費參加",
            "info": "本局屯區藝文中心為延續辦理假日廣場藝文表演活動，提供民眾假日好去處，將休閒寓教於文化，因應十週年2019年假日廣場活動以「藝術市集」為主題，將街頭藝人、文創、手作體驗DIY、胖卡餐車與二手商品等為市集攤商邀請對象，並保留原有假日廣場的演出活動模式以帶動氣氛與吸引人潮。市集規劃於每個月擇一周末兩日辦理，期望能讓民眾就近體驗目前的文創發展與藝文流行元素，另外也讓民眾可以將家中的二手商品整理後讓有需要的人可以以合理的價格購買或交換，以提供平台讓街頭藝人、文創者可以販售相關創作與展現自身技藝，以利推動藝文，並兼顧環保永續發展。",
            "note": ""
        },
        {
            "myClass": "展覽",
            "title": "承藝-藝術家接力展~首展 王守英",
            "myDate": "2019-06-29 09:00 ~ 2019-12-29 17:30",
            "location": "1、2樓電梯口",
            "MyJoin": "",
            "info": "接力展示在地藝術創作者、工藝職人之深耕成就，對在地創作者的文化耕耘表達最誠摯的敬意，也象徵藝術發展的永續延綿。",
            "note": ""
        },
        {
            "myClass": "展覽",
            "title": "「掌中乾坤—臺灣布袋戲之美」特展",
            "myDate": "2019-07-06 09:00 ~ 2020-03-01 17:30",
            "location": "美學空間",
            "MyJoin": "",
            "info": "轟動武林、驚動萬教的「掌中乾坤—臺灣布袋戲之美」特展要上檔囉!!由享譽國內外的臺中聲五洲掌中劇團王英峻團長擔任策展人，「掌中乾坤—臺灣布袋戲之美」特展即將於7/6隆重登場(美學空間)，不僅展示劇團的壓箱寶布袋戲偶，還有實體戲台讓小朋友實際操作、以及各項布袋戲推廣工作坊，兼具教育與娛樂性，敬請期待!!主辦單位:台中市立屯區藝文中心展出單位:台中聲五洲掌中劇團策展人王英峻【展覧/工作坊預告】展覽收藏展品提供:【聲五洲布袋戲】王英峻偶盔:陳錫煌/青燈偶頭:許憲章/蘇明雄/林志明偶衣:張金隆/李羽玥/道具:陳錫煌/謝昇源",
            "note": ""
        },
        {
            "myClass": "藝術營",
            "title": "玩樂藝夏~2019 屯藝暑期藝術營",
            "myDate": "2019-07-09 09:00 ~ 2019-08-23 17:00",
            "location": "B1藝享空間或實驗劇場",
            "MyJoin": "詳報名表",
            "info": "2019屯藝暑期藝術營即將開跑囉！ 還在煩惱暑假孩子們去處嗎?來屯區藝文中心就對了今年將結合本市品牌藝文團隊及優質藝文工作者，提供7梯次優質且多元的藝術營隊，讓孩子們度過藝文氣息滿滿的歡樂暑假。活動預告小青蛙劇團：手偶創作、氣球懸絲偶、半罩式偶創作、黑光劇體驗...土星垣創意工作室：黏土畫、彩繪雨傘、軟陶體驗麵包及皮革零錢包...妙璇舞蹈團：現代即興的肢體伸展、水墨美術的拓印版畫，還有現代舞蹈與繪畫、說演故事...身聲劇場：生活樂器、世界樂器、身體打擊...大木童玩：製作各種童玩（包括原住民、客家、閩南、國外、植物童玩等共6種）及體驗麥芽糖等傳統童趣美食...大鵬老師：小道具魔術教學、默劇演練創造焦點：傳統雜技及馬戲早鳥優惠：6/1(六)~6/8(六)現場報名享8折優惠唷",
            "note": ""
        },
        {
            "myClass": "屯藝學堂",
            "title": "108年度下半年「屯藝學堂-藝文研習班」",
            "myDate": "2019-07-13 09:00 ~ 2019-09-01 17:30",
            "location": "屯區藝文中心-3樓研習教室",
            "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名，臺中市太平區大興路201號）",
            "info": "108年度下半年「屯藝學堂-藝文研習班」招生簡章、課程表、報名表。",
            "note": ""
        },
        {
            "myClass": "巿集",
            "title": "2019游於藝X藝術市集",
            "myDate": "2019-07-13 10:00 ~ 2019-08-11 16:00",
            "location": "戶外廣場",
            "MyJoin": "請參照info",
            "info": "2019藝術市集7、8月份擴大辦理！8月份的市集活動將以箭術、快閃活動與各類DIY、小舖……等多樣性藝文手作為主！！有趣好玩的暑假時光就是在屯區藝文中心2019游於藝X藝術市集活動！",
            "note": ""
        //},
        // {
        //     "myClass": "表演",
        //     "title": "屯藝綻放—樂興之時音樂大使《屯區饗樂趣》系列活動",
        //     "myDate": "2019-07-27 15:00 ~ 2019-09-28 21:00",
        //     "location": "實驗劇場、戶外露天劇場",
        //     "MyJoin": "講座與音樂會│免費入場、課程│四堂課800元",
        //     "info": "覺得傳統、古典音樂很難嗎？今年屯藝駐館團隊「樂興之時管絃樂團」將安排一系列的音樂活動，讓音樂的種子在大家心中成長茁壯喔！",
        //     "note": ""
        // },
        // {
        //     "myClass": "展覽",
        //     "title": "臺中市書法協會~韻生筆端翰墨特展",
        //     "myDate": "2019-07-27 09:00 ~ 2019-08-18 17:30",
        //     "location": "展覽室B",
        //     "MyJoin": "",
        //     "info": "成立於民國80年的臺中市書法協會，目前會員將近200名，涵蓋社會各階層，匯聚老、中、壯、青等世代，協會除一年一度巡迴展外，並不定期辦理書法研習、講座、觀摩、揮毫、文化采風等活動，對書法傳承與發揚，具有極其重大意義。會員多人曾獲全省性及全國性美展大獎，書法創作亦屢創佳績，期望藉由展出，作為一個書法交流溝通平台，促進文化藝術的發展。",
        //     "note": ""
        // },
        // {
        //     "myClass": "屯藝學堂",
        //     "title": "108年度下半年「屯藝學堂-藝文研習班」新課程推薦─浪漫手作金屬飾界班",
        //     "myDate": "2019-07-31 09:00 ~ 2019-09-03 17:30",
        //     "location": "屯區藝文中心-3樓研習教室",
        //     "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名，臺中市太平區大興路201號）",
        //     "info": "108年度下半年「屯藝學堂-藝文研習班」新課程推薦─浪漫手作金屬飾界班",
        //     "note": ""
        // },
        // {
        //     "myClass": "展覽",
        //     "title": "翰墨協奏曲－臺師大美術創作碩士班在職專班國畫組畢業聯展",
        //     "myDate": "2019-08-02 09:00 ~ 2019-09-01 17:30",
        //     "location": "展覽室A",
        //     "MyJoin": "",
        //     "info": "展覽由國立臺灣師範大學美術學系碩士在職專班美術創作國畫組畢業生聯合展出，以現代水墨多元思考的創作模式或有傳統獨特的「筆墨」呈現，重新省思當下生活中的環境變遷，分別帶來不同的主題系列創作：《蕨處逢生》表現蕨類的強韌生命力與環保意識；《時光逆旅》你我都是生命旅程中的漫遊者，讓我們去發掘歷史新痕跡－悲情的大屯郡守官舍；《眷戀》描寫眷村情懷那種停滯時光裡的濃醇情意…探討社會議題，試圖將生命哲學以各種藝術角度來做詮釋。",
        //     "note": ""
        // },
        // {
        //     "myClass": "其他",
        //     "title": "屯藝綻放—樂興之時音樂大使《屯區饕樂趣》：寶寶音樂律動課",
        //     "myDate": "2019-08-04 11:00 ~ 2019-08-24 12:00",
        //     "location": "實驗劇場",
        //     "MyJoin": "事前線上報名繳費",
        //     "info": "吳宇晨老師要透過《身體律動》、《自製樂器》、《主題故事》、《手作繪畫》等，讓小朋友們用輕鬆愉快的方式，在音樂王國裡滿載而歸！活動myDate：8/4(日)、8/10(六)、8/18(日)、8/24(六)，一期共4堂，每堂課40分鐘。",
        //     "note": ""
        // },
        // {
        //     "myClass": "藝術營",
        //     "title": "大木童玩",
        //     "myDate": "2019-08-06 09:00 ~ 2019-08-09 17:00",
        //     "location": "藝享空間、演藝廳大廳、戶外等",
        //     "MyJoin": "報名費2,500元，6/1開始報名",
        //     "info": "以深入淺出的方式，介紹台灣400年的童玩歷史，與台灣童玩的消失與復興，讓孩子在認識童玩的過程之中，體驗童玩的樂趣，另安排各國童玩遊戲體驗，讓孩子在玩樂中學習，在懷舊中放眼世界。",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "《天地行者》音樂會前導講座 「 膽敢褻瀆經典 那你說個道理出來」",
        //     "myDate": "2019-08-10 15:00 ~ 2019-08-10 16:30",
        //     "location": "3F大會議室",
        //     "MyJoin": "15:00開始，於14:30開放排隊，免費入場，座位198席，額滿為止",
        //     "info": "處世若大夢 胡為勞其生 所以終日醉 頹然臥前楹 覺來眄庭前 一鳥花間鳴 借問此何時 春風語流鶯 感之欲嘆息 對酒還自傾 浩歌待明月 曲盡已忘情如此文采情懷，要一位一百多年前的歐洲人如何入樂?馬勒，硬是做到了，竟然還未讓原生文化承襲者感覺唐突。那，為什麼要再去弄它?為何要冒褻瀆經典之大不韙幹這事?又是如何辦到的?且讓這膽大包天的音樂家告訴你。",
        //     "note": ""
        // },
        // {
        //     "myClass": "巿集",
        //     "title": "【2019游於藝X藝術市集】我的微電影",
        //     "myDate": "2019-08-10 10:00 ~ 2019-08-11 16:00",
        //     "location": "戶外園區",
        //     "MyJoin": "即日起至大廳服務臺現場報名，額滿為止",
        //     "info": "想在這個夏日為自己、家人或朋友留下影片嗎？來屯區藝文中心就能拍攝屬於自己的微電影myDate：2019/8/10時間：10:00-16:00名額：12組(1組1-5人，1組拍攝20分鐘)費用：600元報名方式：即日起至大廳服務臺報名洽詢電話：04-23921122#600(服務台)",
        //     "note": ""
        // },
        // {
        //     "myClass": "藝術營",
        //     "title": "大鵬老師",
        //     "myDate": "2019-08-13 09:00 ~ 2019-08-16 17:00",
        //     "location": "藝享空間",
        //     "MyJoin": "報名費2,000元，6/1開始報名",
        //     "info": "與屯區藝文中心廣受家長歡迎的繪本故事老師合作，以多元繪本開啟學齡兒童的豐富世界",
        //     "note": ""
        // },
        // {
        //     "myClass": "表演",
        //     "title": "2019非舞不可舞蹈交流歸國演出《京舞門》",
        //     "myDate": "2019-08-17 19:30 ~ 2019-08-17 21:30",
        //     "location": "實驗劇場",
        //     "MyJoin": "兩廳院售票500元",
        //     "info": "「敞開心界，拓寬眼界，看見世界」非舞不可舞團，向來最重視的乃是教育，本次舞蹈交流「北京行」的主軸，不僅讓團員看看世界，往更高一層學習與開拓國際視野，希望能藉由舞蹈學習與交流，與課程內容嚴謹的教育，舞技上提升自我能力，心態上昇華自我要求的境界。",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "偶戲工作坊-偶鞋偶扇DIY",
        //     "myDate": "2019-08-17 09:30 ~ 2019-08-17 12:30",
        //     "location": "一樓美學空間",
        //     "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名，臺中市太平區大興路201號）",
        //     "info": "布袋戲表演中，優美傳神的戲偶無疑是全場演出的焦點，配合美學空間「掌中乾坤-臺灣布袋戲之美」展覽,屯區藝文中心辦理多項布袋戲戲偶使用道具製作研習課程，以保存推廣本土手工藝品藝術。8/17辦理偶鞋偶扇DIY研習，各年齡層都能來參與體驗，課程內容有偶鞋偶扇的簡單解說與認識、佩戴，讓參與者能夠了解如何自製偶鞋偶扇，如何修邊讓其更加精緻！趕快來報名參加，一同來探索傳統藝術之美吧。",
        //     "note": ""
        // },
        // {
        //     "myClass": "其他",
        //     "title": "美學空間電影播放~美女與野獸(Beauty and the Beast)",
        //     "myDate": "2019-08-18 15:00 ~ 2019-08-18 17:10",
        //     "location": "一樓美學空間",
        //     "MyJoin": "自由入場，座位約100席，額滿為止。10歲(含)以下小朋友，應有成人陪同。",
        //     "info": "2017年上映的迪士尼經典動畫改編真人電影，由人氣女星艾瑪華生領銜，搭配兩位新生代英倫帥哥-丹史蒂文森與路克伊凡斯，重新演繹《美女與野獸》，獻唱動畫版中耳熟能詳的歌曲。透過最新的視覺特效，魔法城堡中的燭台、時鐘、茶壺太太都將華麗登場。",
        //     "note": ""
        // },
        // {
        //     "myClass": "藝術營",
        //     "title": "創造焦點",
        //     "myDate": "2019-08-20 09:00 ~ 2019-08-23 17:00",
        //     "location": "藝享空間",
        //     "MyJoin": "報名費2,500元，6/1開始報名",
        //     "info": "以傳統雜技及馬戲等為主題，結合感官統合訓練、表演肢體訓練等，啟發孩子的多元智慧及表演天分",
        //     "note": ""
        // },
        // {
        //     "myClass": "展覽",
        //     "title": "石光寄情~臺中市石友會108年度會員成果展",
        //     "myDate": "2019-08-23 09:00 ~ 2019-09-15 17:30",
        //     "location": "展覽室B",
        //     "MyJoin": "",
        //     "info": "幾千年來，石頭和人類的互動，無論在生活或心靈上都密不可分，隨著文明的發展，人類開始懂得欣賞雅石，把從山海河中取得，經過大自然洗練的石頭，擺進廳堂、置於案頭、裝飾庭園；尤其是在廳堂中或案頭上的精緻雅石，更能讓文人雅士、販夫走卒得到身心靈上的慰藉。石光寄情，取自於白居易〈對酒〉之名句：蝸牛角上爭何事，石火光中寄此身。期盼觀賞者在此身中寄情石光，洗滌心靈。",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "開啟欣賞舞蹈的關鍵密碼",
        //     "myDate": "2019-08-25 15:00 ~ 2019-08-25 16:30",
        //     "location": "3F大會議室",
        //     "MyJoin": "15:00開始，於14:30開放入場，座位198席，額滿為止",
        //     "info": "現代舞常讓人看不懂？其實不是看不懂，是缺少入門的關鍵密碼。舞蹈空間讓您輕鬆掌握欣賞撇步的123，讓人人都可成為頭頭是道的「舞評家」。",
        //     "note": ""
        // },
        // {
        //     "myClass": "展覽",
        //     "title": "2019藝響世界油畫會聯展",
        //     "myDate": "2019-09-06 09:00 ~ 2019-09-29 17:30",
        //     "location": "展覽室A",
        //     "MyJoin": "",
        //     "info": "藝響世界油畫會成立至今第11年，會員們將生命體驗揮灑於油畫中，提煉創作思維融入在每幅作品裡，抒發情感也展現個人畫藝與巧思；同時藉著展覽以畫會友，與廣大的社會交流，分享他們的希望與夢想，亦能汲取來自各方的養分，開拓更深的創作未來。",
        //     "note": ""
        // },
        // {
        //     "myClass": "表演",
        //     "title": "屯藝綻放—2019 OpenHouse屯區劇院開門",
        //     "myDate": "2019-09-07 14:00 ~ 2019-09-08 15:00",
        //     "location": "演藝廳／實驗劇場",
        //     "MyJoin": "兩廳院售票100元",
        //     "info": "打開劇院的大門，一探後臺的神秘面紗！今年特邀請素有臺語天團之稱的「金枝演社」帶來充滿新奇的劇院導覽。以「演員的一日劇場生活」為主軸，帶領一般大眾深入本中心演藝廳及實驗劇場，觀看平凡無奇的黑色空間，如何打造出令人目眩神迷的舞臺效果。幕前與幕後的兩般世界，體驗劇場工作者的無限樂趣！",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "中秋月餅自己做",
        //     "myDate": "2019-09-07 10:00 ~ 2019-09-07 12:00",
        //     "location": "一樓美學空間",
        //     "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名）",
        //     "info": "一年一度的中秋佳節又將來臨了，中秋節不吃月餅要做什麼呢?今年的中秋月餅很不一樣喔！要帶大家做的是冰皮月餅，最適合在夏天冰冰涼涼的吃，內餡是百吃不膩的紅豆沙，不甜、不膩好清爽，還有~QQ的麻糬呢，餅皮可以做出很夢幻很粉嫩的色彩看了就好想咬一口，還在等什麼呢?趕快來報名參加吧。",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "謝宇威的歌與畫",
        //     "myDate": "2019-09-08 15:00 ~ 2019-09-08 17:00",
        //     "location": "3F大會議室",
        //     "MyJoin": "15:00開始，於14:30開放入場，座位198席，額滿為止",
        //     "info": "籍貫台灣桃園縣新屋鄉 出生於台北市高中就讀於中正高中美術實驗班，保送文化大學美術系西畫組詞曲創作人、廣播DJ、電視節目主持人及製作人、繪畫工作者、藝術策展人、演員、歌手",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "繽紛水泥皂盤",
        //     "myDate": "2019-09-15 10:00 ~ 2019-09-15 12:00",
        //     "location": "屯區藝文中心一樓美學空間",
        //     "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名，臺中市太平區大興路201號）",
        //     "info": "手工皂的天然溫和、細緻質地吸引許多的愛用者，但手工皂遇水容易軟化、變成皂糊的特性，卻也是許多人的使用經驗及困擾，讓我們利用色彩繽紛的琉璃石與水泥的材質，搭配可愛的小公仔，在老師的帶領下，製作一個獨一無二的繽紛皂盤，讓你的肥皂也有一個專屬的家，還在等什麼呢?趕快來報名參加吧。",
        //     "note": ""
        // },
        // {
        //     "myClass": "展覽",
        //     "title": "臺中市太平區長青學苑20週年師生成果展",
        //     "myDate": "2019-09-20 09:00 ~ 2019-10-13 17:30",
        //     "location": "展覽室B-1",
        //     "MyJoin": "",
        //     "info": "太平區長青學苑在區公所及曉明社會福利基金會共同努力下，受到市民肯定與支持，為增進長者持續學習與社會互動機會，將學員們多年來的成果與社會大眾分享，展出彩墨、書法、油畫、攝影、素描等，透過不同主題作品充分展現樂齡生命的色彩與美麗，不僅為高齡學習的重要發聲，更為終身學習做了最佳的見證與示範。",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "偶戲工作坊-戲偶拂塵DIY",
        //     "myDate": "2019-09-21 09:30 ~ 2019-09-21 12:30",
        //     "location": "屯區藝文中心一樓美學空間",
        //     "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名，臺中市太平區大興路201號）",
        //     "info": "布袋戲表演中，優美傳神的戲偶無疑是全場演出的焦點，配合美學空間「掌中乾坤-臺灣布袋戲之美」展覽,屯區藝文中心辦理多項布袋戲偶道具製作研習課程，以保存推廣本土手工藝品藝術。9/21辦理戲偶拂塵DIY研習，各年齡層都能來參與體驗，課程內容有戲偶用拂塵的簡單解說與認識、佩戴，了解如何自製拂塵，趕快來報名參加。",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "臺灣古文書原件收藏家【郭双富】~懷舊臺中的記憶光影",
        //     "myDate": "2019-09-22 15:00 ~ 2019-09-22 16:00",
        //     "location": "一樓美學空間",
        //     "MyJoin": "自由入場，座位約100席，額滿為止。",
        //     "info": "本次講座郭双富老師將代領大家欣賞多年收集的老寫真，台中州廳、市役所、台中公園、天外天、霧峰萊園、台中一中、台中師範、台中火車站等。從老寫真認識歷史人物，如林獻堂先生、楊肇嘉先生、張煥珪先生、廖繼春先生等台中曾經發生的事物，民國46年中華路林烈堂別墅拍攝「愛情十字路」，文化協會、櫟社、一新會、清信醫院、台中產婆學校、醉月樓等等。 ",
        //     "note": ""
        // },
        // {
        //     "myClass": "其他",
        //     "title": "2019臺中國際動畫影展-得獎片大突襲",
        //     "myDate": "2019-09-22 10:00 ~ 2019-09-22 12:00",
        //     "location": "一樓美學空間",
        //     "MyJoin": "自由入場，座位約100席，額滿為止。",
        //     "info": "播放臺中國際動畫影展得獎片之片花錦集",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "彩晶墜飾DIY",
        //     "myDate": "2019-09-28 10:00 ~ 2019-09-28 12:00",
        //     "location": "屯區藝文中心一樓美學空間",
        //     "MyJoin": "一樓服務台繳費報名（恕不接受電話及網路報名，臺中市太平區大興路201號）",
        //     "info": "玻璃經過高溫窯燒；有著如水晶般的剔透度，加入金、銀、特殊玻璃顏料的濃淡變化，在晶瑩剔透中訴說著璀璨奪目的藝術文化，美麗而又兼具實用與裝飾性，讓彩晶墜飾成為極具藝術價值的玻璃創作。妝點配戴在身上，可讓整體造型加分。製作時色彩因人而異，背景的顏色也會使彩晶墜飾呈現不同的變化，每一件的斑斕色彩，就是一幅彩色的畫作，還在等什麼呢?趕快來報名參加吧。",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "親子研習 – 彩色毛毛蟲黏土存錢筒(已額滿)",
        //     "myDate": "2019-09-29 10:00 ~ 2019-09-29 12:00",
        //     "location": "美學空間",
        //     "MyJoin": "250元，一樓服務台報名",
        //     "info": "　　這是一堂英文繪本故事結合黏土親子手作的課程，聽完英文繪本故事之後又可以玩黏土，本課程非全美語，也適合尚未學過美語的幼兒童。　　彩色毛毛蟲存錢筒色彩鮮豔豐富，除了吸引幼兒童製作興趣外，存錢筒具實用性，鼓勵幼兒童從小養成儲蓄的美德。　　快來屯區藝文中心，讓老師説英文繪本故事給你聽，教你製作黏土彩色毛毛蟲存錢筒!!!",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "我的優人之路-讓藝術回歸生活，生活回歸初衷",
        //     "myDate": "2019-10-05 15:00 ~ 2019-10-05 17:00",
        //     "location": "3F大會議室",
        //     "MyJoin": "15:00開始，於14:30開放入場，座位198席，額滿為止",
        //     "info": "優人神鼓是台灣一個表演藝術團體，前身為優劇場，1988年由創辦人劉若瑀於台北市木柵老泉山創立；1993年黃誌群加入擔任擊鼓指導，成為優人神鼓。優人神鼓以「先學靜坐，再教擊鼓」為原則，揉合果托夫斯基身體訓練、東方傳統武術、擊鼓、太極導引、民間戲曲、技藝、宗教科儀、靜坐等元素，創立了一套獨特的表演形式「當代肢體訓練法」。",
        //     "note": ""
        // },
        // {
        //     "myClass": "表演",
        //     "title": "屯藝綻放—達康.come笑現場《走味關係》",
        //     "myDate": "2019-10-13 14:30 ~ 2019-10-13 16:00",
        //     "location": "演藝廳",
        //     "MyJoin": "兩廳院售票550元",
        //     "info": "2018已經笑翻南北… 2019用笑征服大臺中！ 人與人之間各種關係，包含兩性關係、家庭關係、職場關係、階級關係、一言難盡的關係，透過漫談、短劇、音樂故事呈現各種關係最走味崩壞的時刻，在哈哈大笑之間體驗最為冷暖自知的走味關係！ ",
        //     "note": ""
        // },
        // {
        //     "myClass": "表演",
        //     "title": "屯藝綻放—頑劇場《她們》Metamorphosis",
        //     "myDate": "2019-10-19 14:30 ~ 2019-10-19 16:00",
        //     "location": "實驗劇場",
        //     "MyJoin": "兩廳院售票500元",
        //     "info": "從前從前有一個小女孩，她吃了一顆蘋果，然後她就死掉了 ...從前從前有另一個小女孩，她遇到了大野狼，然後她就被吃掉了...從前從前再一個小女孩，她腳生得太大，塞不進美麗的鞋子，於是她也死了... ......「等一下！」說書人喊道，「我還有個沒死的故事......」 ",
        //     "note": ""
        // },
        // {
        //     "myClass": "其他",
        //     "title": "美學空間電影播放~愛滿人間 (Mary Poppings Returns)",
        //     "myDate": "2019-10-20 15:00 ~ 2019-10-20 17:11",
        //     "location": "一樓美學空間",
        //     "MyJoin": "自由入場，座位約100席，額滿為止。10歲(含)以下小朋友，應有成人陪同。",
        //     "info": "2018年美國歌舞奇幻喜劇電影，為1964年電影《歡樂滿人間》續集，改編兒童文學作家P·L·卓華斯小說《瑪麗·包萍》。大蕭條時期倫敦，處處可見蕭瑟寂寥，班克斯一家更是壟罩低氣壓之下，三個孩子因喪親之痛，鬱鬱寡歡，父親麥可班克斯束手無策，就在他幾乎失去所有希望的時候，神奇的魔法從天而降，麥可兒時的褓母瑪莉包萍驚喜現身…",
        //     "note": ""
        // },
        // {
        //     "myClass": "假日研習",
        //     "title": "親子研習 – 萬聖節DIY南瓜燈籠",
        //     "myDate": "2019-10-27 10:00 ~ 2019-10-27 12:00",
        //     "location": "美學空間",
        //     "MyJoin": "150元，一樓服務台報名",
        //     "info": "　　南瓜燈龍是許多人提到萬聖節的第一印象，小朋友你們知道傑克南瓜燈的由來嗎?　　紙燈籠大圓的造型增加作品的童趣，彩繪的方式去掉雕刻步驟，可以讓不同年齡層的孩子們都輕鬆入手，最後加入各式色紙增添整體作品的豐富性、層次感。小朋友來發揮你的創造力做一盞獨一無二的燈籠吧!",
        //     "note": ""
        // },
        // {
        //     "myClass": "表演",
        //     "title": "屯藝綻放—2019音樂舞蹈藝術節《史派德奇遇記之飛飛飛》舞蹈空間舞蹈團",
        //     "myDate": "2019-11-02 19:30 ~ 2019-11-02 20:30",
        //     "location": "演藝廳",
        //     "MyJoin": "兩廳院售票 200/300/500元",
        //     "info": "喜歡跳舞的史派德(spider)珠兒，看到超酷的老鷹在飛翔，不禁異想天開也要學飛！但大家都要她「死心」，別再做夢，不認輸的珠兒便潛入黑森林找公雞、黃山雀、藍鵲、蝙蝠等各種鳥類討教，沒有翅膀的蜘蛛，到底能不能飛起來？ ",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "《說故事的我們，聽故事的你》從劇場表演看見親子關係",
        //     "myDate": "2019-11-03 15:00 ~ 2019-11-03 17:00",
        //     "location": "3F大會議室",
        //     "MyJoin": "15:00開始，於14:30開放入場，座位198席，額滿為止",
        //     "info": "親子關係的建立，需要用心聆聽與傾訴、需要耐心溝通與陪伴。在劇場看戲，猶如體驗不同的人生風景。原來看戲，即看見生活、聽見心聲、遇見另一個生活的可能性。",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "【金枝演社劇團】現代劇團裡的戲班文化與演員日常",
        //     "myDate": "2019-11-09 15:00 ~ 2019-11-09 17:00",
        //     "location": "一樓美學空間",
        //     "MyJoin": "活動當日14:30開放排隊入場，座位約50席，額滿為止。",
        //     "info": "【金枝演社劇團】是台灣劇場界少數以演員為本的現代劇場，這意味著，演員是固定到劇場工作的，演員長時間工作與生活的相處，培養出絕佳的默契，如此一來，演員能更專注於藝術創作及自身訓練，並從生活取得靈感，不斷驗證「從土地長出來的文化最感人」。",
        //     "note": ""
        // },
        // {
        //     "myClass": "其他",
        //     "title": "美學空間電影播放~胡桃鉗與奇幻四國 (The Nutcracker and the Four Realms)",
        //     "myDate": "2019-11-17 15:00 ~ 2019-11-17 16:40",
        //     "location": "一樓美學空間",
        //     "MyJoin": "自由入場，座位約100席，額滿為止。10歲(含)以下小朋友，應有成人陪同。",
        //     "info": "2018年美國奇幻冒險電影。剛失去母親的少女克拉拉，心急得想找到母親遺留下來的神秘鑰匙，原來母親在過逝後，留下一個鎖上了的音樂盒。耶誕夜當晚，克拉拉循著神秘線索，進入一個奇幻國度，國度中竟有四個王國，她踏上驚喜冒險之旅，經過了雪片之地、花卉之地、甜糖之地，發現這個不可思議的世界，竟然是母親一手打造的…",
        //     "note": ""
        // },
        // {
        //     "myClass": "表演",
        //     "title": "屯藝綻放—故事工廠《明晚，空中見》口碑加演",
        //     "myDate": "2019-11-23 19:30 ~ 2019-11-23 21:35",
        //     "location": "演藝廳",
        //     "MyJoin": "兩廳院售票 400/600/800/1000/ 1200/1500/1800元",
        //     "info": "如果科技始終來自於人性，那麼科幻就來自生命的缺憾。《明晚，空中見》超時空親情救援~蔡燦得、房思瑜、林東緒、劉珊珊、郭耀仁、林子恆、李運慶、黃一嘉　口碑加演！",
        //     "note": ""
        // },
        // {
        //     "myClass": "講座",
        //     "title": "漫才搞笑搞什麼？講師：達康.come（陳彥達、何瑞康）",
        //     "myDate": "2019-12-14 15:00 ~ 2019-12-14 16:30",
        //     "location": "3F大會議室",
        //     "MyJoin": "15:00開始，於14:30開放入場，座位198席，額滿為止",
        //     "info": "由阿達、康康組成之雙人搞笑漫才組合，成立於2013年初，兩人從事搞笑、漫才表演至今超過10年，持續嘗試運用各種戲劇特性結合漫才精神，發展各類型喜劇表現的可能。",
        //     "note": ""
        // },
        // {
        //     "myClass": "其他",
        //     "title": "美學空間電影播放~萌牛費迪南(Ferdinand)",
        //     "myDate": "2019-12-22 15:00 ~ 2019-12-22 16:49",
        //     "location": "美學空間",
        //     "MyJoin": "自由入場，座位約100席，額滿為止。10歲(含)以下小朋友，應有成人陪同。",
        //     "info": "2017年美國上映動畫電影，根據曼羅．里夫文發表於1936年的兒童文學書籍《愛花的牛》改編而成。費迪南是一隻小小的鬥牛，平時喜歡安靜的待在樹下聞聞花香，不喜歡打架。後來由於父親被送去鬥牛場沒有回來，遭受打擊而逃離公牛之家，後遇見小女孩妮娜和她爸爸，過上一段安逸的生活。隨著費迪南的成長與逐漸茁壯，他的性情依舊，然而有天他卻不小心在人群中闖了禍，導致被警察強制帶走，又回到了公牛之家。而剛好名鬥牛士普米羅來到了這裡，他要選出最強壯的鬥牛來做為他的引退之戰對手。",
        //     "note": ""
         }
    ]





    modeRow();

    // function modeColumn() {
    //     for (var i = 0; i < jsonList.length; i++) {
    //         var result = "";
    //         result +=
    //             `<div class="card" id="deleteColumn">
    //         <img src="img/carousel/1.jpg" class="card-img-top" alt="..."/>
    //             <div class="card-body">
    //                 <h5 class="card-title">${jsonList[i].title}</h5>
    //                 <p class="card-text">${jsonList[i].myDate}</p>
    //                 <p class="card-text" style="overflow: hidden;white-space:nowrap;text-overflow: ellipsis">${jsonList[i].info}</p>
    //                 <a href="#" class="btn btn-primary">Go somewhere</a>
    //             </div>
    //     </div>`;
    //         $(".card-columns").append(result);
    //     }
    // }


    function modeRow() {
        for (var i = 0; i < jsonList.length; i++) {
            var result = "";
            result +=
                `<div class="row no-gutters" id="deleteRow">
                      <div class="col-md-4">
                        <img src="img/${i}.jpg" class="card-img" alt="..."/>
                      </div>
                      <div class="col-md-8">
                            <div class="card-body">
                                <h5 class="card-title">${jsonList[i].title}</h5>
                                <p class="card-text"><small class="text-muted">${jsonList[i].myDate}</small></p>
                                <p class="card-text" style="overflow: hidden;white-space:nowrap;text-overflow: ellipsis">
                                ${jsonList[i].info}</p>
                                <a href="#" class="btn btn-primary">Go somewhere</a>
                            </div>
                      </div>
                </div>`
            $(".card").append(result);
        }
    }

    ////////////排序切換
    // var now = true;
    // function readMode() {
    //     if (now ==true) {
    //         modeColumn();
    //         now = false;
            
    //     } else if (now == false) {
    //         modeRow();
    //         now = true;
            
    //     };
    // };

    //
    // $( "#onAndOff" ).toggle(function() {
    //     modeRow();
    //   }, function() {
    //     modeColumn();
    //   });
    //
    //





    ////////////////////////免費
    // var result = "";
    // for (var i = 0; i < jsonList.length; i++) {
    //     var temp = jsonList[i].myMyJoin;
    //     var free = temp.indexOf(額滿為止);
    //     if (free != -1) {
    //         result +=
    //             `<div class="row no-gutters">
    //                     <div class="col-md-4">
    //                         <img src="img/carousel/0.jpg" class="card-img" alt="..."/>
    //                     </div>
    //                     <div class="col-md-8">
    //                             <div class="card-body">
    //                                 <h5 class="card-title">${jsonList[i].title}</h5>
    //                                 <p class="card-text"><small class="text-muted">${jsonList[i].myDate}</small></p>
    //                                 <p class="card-text" style="overflow: hidden;white-space:nowrap;text-overflow: ellipsis"                       >
    //                                 ${jsonList[i].info}</p>
    //                                 <a href="#" class="btn btn-primary">Go somewhere</a>
    //                             </div>
    //                     </div>
    //                 </div>`;
    //         $(".card").append(result);
    //         console.log(result);
    
    //     }
    // }
    //




});